
* Files
#+srcname: files
#+begin_src sh
ls eng-all/*.zip
#+end_src

#+results: files
| eng-all/googlebooks-eng-all-1gram-20090715-0.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-1.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-2.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-3.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-4.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-5.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-6.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-7.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-8.csv.zip |
| eng-all/googlebooks-eng-all-1gram-20090715-9.csv.zip |

* Split
#+begin_src perl :tangle split.pl
  $OUTDIR = 'eng-all-split-clean';
  while( <> ) {
      ($ngram) = split '\t';
      next unless $ngram =~ /^[A-Za-z][a-z']*$/;
      if($ngram ne $ngram_old) {
          $dir = substr($ngram, 0, 2);
          close FILE if $ngram_old;
          mkdir "$OUTDIR/$dir";
          open FILE, ">$OUTDIR/$dir/$ngram";
          $ngram_old = $ngram;
      }
      print FILE;
  }
#+end_src

#+begin_src perl :results output
  $a = 'aaatbbbtccc';
  if( $a =~ /.*tbc.*/ ) {
      print 'yep\n';
  }
  else {
      print 'nope\n';
  }
#+end_src

#+results:
: nope\n


#+begin_src perl :results output
  $_ = 'abc';
  ($first, $second) = split ".";
  print $first;
#+end_src

#+results:

